<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6d7341639917f0d26d6ce52d1c0c853163675f2b82d7243c4a612458e1799813","plan_job_ref":"Job Terraform Plan #37 at https://github.com/NiyiOdumosu/confluent-cloud-infra/actions/runs/5671402484","plan_hash":"7cf5012747c0056cb97c413b2ed2bc4fe7d50de598adea6760e27f6329dc4d1a","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __non-prod/public/kafka__
With var files: `non-prod/public/non-prod.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_role_binding.developer-read will be created
  + resource "confluent_role_binding" "developer-read" {
      + crn_pattern = "crn://confluent.cloud/organization=fff39d13-91b7-444b-baa6-c0007e80e4d5/environment=env-rvw7k/cloud-cluster=lkc-z3nkvz/kafka=lkc-z3nkvz/topic=*"
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "DeveloperRead"
    }

  # confluent_service_account.app-consumer will be created
  + resource "confluent_service_account" "app-consumer" {
      + api_version  = (known after apply)
      + description  = "Service Account for app consumers"
      + display_name = "app-consumer-service-account"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #37](https://github.com/NiyiOdumosu/confluent-cloud-infra/actions/runs/5671402484)